Rokasbarasa1/ESP32-self-balancing-robot/src/main.c
#include <stdio.h>
#include <driver/gpio.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include "driver/spi_master.h"
#include "esp_timer.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_task_wdt.h"

// Drivers
#include "../lib/mpu6050/mpu6050.h"
#include "../lib/TB6612/TB6612.h"
#include "../lib/gy271_qmc5883l/gy271.h"
#include "../lib/nrf24l01/nrf24l01.h"
#include "../lib/optical_encoder/optical_encoder.h"

// Other imports
#include "../lib/util/ned_coordinates/ned_coordinates.h"
#include "../lib/util/spi/spi.h"
#include "../lib/pid/pid.h"
#include "../lib/pid2/PID_V1.h"

// Switches the magnetometer axis to be like accelerometer and gyro
void fix_mag_axis(float* magnetometer_data);
void check_calibrations();
void init_sensors();
void init_esp32_peripherals();
void init_loop_timer();
void track_time();
void get_initial_position();
void extract_joystick_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll);
void extract_request_type(char *request, uint8_t request_size, char *type_output);
void extract_pid_request_values(char *request, uint8_t request_size, double *added_proportional, double *added_integral, double *added_derivative, double *added_master);
void send_pid_base_info_to_remote();
void send_pid_added_info_to_remote();
char* generate_message_pid_values_nrf24(double base_proportional, double base_integral, double base_derivative, double base_master);
void handle_loop_timing();
double map_value(double value, double input_min, double input_max, double output_min, double output_max);
double apply_dead_zone(double value, double max_value, double min_value, double dead_zone);
void calculate_speeds_no_yaw(float* acceleration, float* gyro_degrees, float* speed, float refresh_rate);
void calculate_speeds(float* acceleration, float* gyro_degrees, float* speed, float refresh_rate);

// ESP32 DevkitC v4 - ESP-WROOM-32D - 160 Mhz

/**
 * SPI3 RADIO nRF24L01+
 * 
 * GPIO23 TX
 * GPIO18 SCK
 * GPIO19 RX
 * 
 * GPIO17 CSN
 * GPIO16 CE
 */


/**
 * TB6612
 * 
 * GPIO33 AI1
 * GPIO32 AI2
 * GPIO25 PWMA
 * GPIO27 BI1
 * GPIO26 BI2
 * GPIO14 PWMB
 * 
 */

/**
 * GY271
 * 
 * GPIO22 SCL
 * GPIO21 SDA
 * 
 */

/**
 * MPU6050
 * 
 * GPIO22 SCL
 * GPIO21 SDA
 * 
 */

/**
 * Encoder 1
 * 
 * GPIO4
 * 
 */

/**
 * Encoder 1
 * 
 * GPIO15
 * 
 */



// Sensor corrections #################################################################################

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2

float hard_iron_correction[3] = {
    185.447609, 360.541288, 491.294615
};
float soft_iron_correction[3][3] = {
    {1.001470, 0.025460, -0.035586},
    {0.025460, 0.405497, -0.054355},
    {-0.035586, -0.054355, 1.219251}
};

float accelerometer_correction[3] = {
    -0.043031, -0.002, 1.011565
};
float gyro_correction[3] = {
    -6.119031, 2.084936, -0.766718
};

// handling loop timing ###################################################################################
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t delta_loop_time = 0;

// Accelerometer values to degrees conversion #############################################################
float accelerometer_x_rotation = 0;
float accelerometer_y_rotation = 0;
float accelerometer_z_rotation = 0;

// Radio config ########################################################################################### 
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// Control with radio ####################################################################################
uint8_t throttle = 0;
uint8_t yaw = 50;
uint8_t pitch = 50;
uint8_t roll = 50;
bool data_received = false;

// Radio to pid target
double pitch_target = 0;
double yaw_target = 0;

// PID errors ##############################################################################################
double error_pitch = 0;
double error_yaw = 0;
double error_speed_x = 0;

// Actual PID adjustment for pitch
const double base_pitch_master_gain = 1.0; // 1 - 100%
const double base_pitch_gain_p = 15.0;
const double base_pitch_gain_i = 250.0;
const double base_pitch_gain_d = 0.31;

// PID for speed
const float speed_gain_p = 0.0; 
const float speed_gain_i = 0.0;
const float speed_gain_d = 0.0;

// Used for smooth changes to PID while using remote control. Dont touch
double pitch_master_gain = base_pitch_master_gain;
double pitch_gain_p = base_pitch_gain_p;
double pitch_gain_i = base_pitch_gain_i;
double pitch_gain_d = base_pitch_gain_d;
double added_pitch_master_gain = 0;
double added_pitch_gain_p = 0;
double added_pitch_gain_i = 0;
double added_pitch_gain_d = 0;

// Refresh rate ##############################################################################################
const float refresh_rate_hz = 400;

// Sensor stuff ##############################################################################################
const float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/refresh_rate_hz)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float gyro_degrees[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
float acceleration_speed[] = {0,0,0};
int8_t optical_encoder_1_result = -1;
int8_t optical_encoder_2_result = -1;
double wheels_speed[] = {0,0};
double target_dead_zone_percent = 0.0;

void app_main() {

    printf("STARTING PROGRAM\n"); 

    init_esp32_peripherals();
    init_sensors();
    init_loop_timer();
    // check_calibrations();
    get_initial_position();

    printf("\n\n====START OF LOOP====\n\n");
    
    struct pid pitch_pid = pid_init(pitch_master_gain * pitch_gain_p, pitch_master_gain * pitch_gain_i, pitch_master_gain * pitch_gain_d, 0.0, esp_timer_get_time(), 1000.0, -1000.0, 1);
    struct pid yaw_pid = pid_init(pitch_master_gain * pitch_gain_p, pitch_master_gain * pitch_gain_i, pitch_master_gain * pitch_gain_d, 0.0, esp_timer_get_time(), 80.0, -80.0, 1);
    struct pid wheel_speed_x_pid = pid_init(speed_gain_p, speed_gain_i, speed_gain_d, 0.0, esp_timer_get_time(), 100.0, -100, 1);


    // struct PidType pitch_pid2;
    // ID_init(&pitch_pid2, pitch_master_gain * pitch_gain_p, pitch_master_gain * pitch_gain_i, pitch_master_gain * pitch_gain_d, PID_Direction_Direct);
    // ID_SetMode(&pitch_pid2, PID_Mode_Automatic);
    // ID_SetSampleTime(&pitch_pid2, (int)(1000/refresh_rate_hz));
    // ID_SetOutputLimits(&pitch_pid2, -255.0, 255.0);

    while (true){
        // Read sensor data ######################################################################################################################


        mpu6050_get_accelerometer_readings_gravity(acceleration_data);
        mpu6050_get_gyro_readings_dps(gyro_angular);
        // gy271_magnetometer_readings_micro_teslas(magnetometer_data);
        // wheels_speed[0] = optical_encoder_get_hertz(optical_encoder_1_result, 2.55, -2.55);
        // wheels_speed[1] = optical_encoder_get_hertz(optical_encoder_2_result, 2.55, -2.55);

        // Convert the sensor data to data that is useful
        // fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050 outputs
        calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation);
        // calculate_yaw(magnetometer_data, &accelerometer_z_rotation);
        convert_angular_rotation_to_degrees(gyro_angular, gyro_degrees, accelerometer_x_rotation, accelerometer_y_rotation, accelerometer_z_rotation, esp_timer_get_time());

        // Receive remote control data ###########################################################################################################

