Rokasbarasa1/ESP32-self-balancing-robot/src/main.c
        // Initialize values to be default again
        throttle = 0;
        yaw = gyro_degrees[2];// Use current yaw as default 
        pitch = 50;
        roll = 50;
        data_received = false;

        
        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);
            
            // Get the type of request
            extract_request_type(rx_data, strlen(rx_data), rx_type);
            
            printf("'%s'\n", rx_type);
            for(uint i = 0; i < strlen(rx_data); i++){
                printf("%c", rx_data[i]);
            }
            printf("\n");
            

            if(strcmp(rx_type, "joystick") == 0){
                printf("Got joystick\n");
                extract_joystick_request_values(rx_data, strlen(rx_data), &throttle, &yaw, &pitch, &roll);
            }else if(strcmp(rx_type, "pid") == 0){
                printf("Got pid\n");

                double added_proportional = 0;
                double added_integral = 0;
                double added_derivative = 0;
                double added_master_gain = 0;

                extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);
                printf("Values %.2f\n", added_proportional);

                pitch_gain_p = base_pitch_gain_p + added_proportional;
                pitch_gain_i = base_pitch_gain_i + added_integral;
                pitch_gain_d = base_pitch_gain_d + added_derivative;
                pitch_master_gain = base_pitch_master_gain + added_master_gain;

                added_pitch_gain_p = added_proportional;
                added_pitch_gain_i = added_integral;
                added_pitch_gain_d = added_derivative;
                added_pitch_master_gain = added_master_gain;

                pid_set_proportional_gain(&pitch_pid, pitch_gain_p * pitch_master_gain);
                pid_set_integral_gain(&pitch_pid, pitch_gain_i * pitch_master_gain);
                pid_set_derivative_gain(&pitch_pid, pitch_gain_d * pitch_master_gain);
                pid_reset_integral_sum(&pitch_pid);

                // PID_SetTunings(&pitch_pid2, pitch_gain_p * pitch_master_gain, pitch_gain_i * pitch_master_gain, pitch_gain_d * pitch_master_gain);

            }else if(strcmp(rx_type, "remoteSyncBase") == 0){
                printf("Got sync base\n");
                send_pid_base_info_to_remote();
                printf("Done\n");
            }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
                printf("Got sync added\n");
                send_pid_added_info_to_remote();
                printf("Done\n");
            }

            rx_type[0] = '\0'; // Clear out the string
            data_received = true;
        }

        // printf("(3) ");
        // track_time();
        // React to the data received from sensors and remote control ###########################################################################################################

        if(gyro_degrees[0] < 45 && gyro_degrees[0] > -45){

            // Update pid targets by transforming remote input
            pitch_target = map_value(pitch, 0.0, 100.0, -20.0, 20.0);
            yaw_target = map_value(yaw, -20.0, 20.0, 0.0, 100.0);
            pid_set_desired_value(&pitch_pid, pitch_target);
            pid_set_desired_value(&yaw_pid, yaw_target);

            // printf("(4) ");
            // track_time();
            // CHeck that acceleration and gravity dont boost each other. 
            // If that is the case then it is wrong. Should not add speed in those cases
            // Also add a limit that the resulting speed cannot be more than 9.8 m/s after dividing that by hertz

            calculate_speeds_no_yaw(acceleration_data, gyro_degrees, acceleration_speed, esp_timer_get_time());

            float gyro_degrees_dead_zone_adjusted[3] = {0.0,0.0,0.0};
            gyro_degrees_dead_zone_adjusted[0] = apply_dead_zone(gyro_degrees[0], 180.0, -180.0, target_dead_zone_percent);
            gyro_degrees_dead_zone_adjusted[1] = apply_dead_zone(gyro_degrees[1], 180.0, -180.0, target_dead_zone_percent);
            gyro_degrees_dead_zone_adjusted[2] = apply_dead_zone(gyro_degrees[2], 180.0, -180.0, target_dead_zone_percent);


            // pitch_pid2.myInput = gyro_degrees_dead_zone_adjusted[0];
            // PID_Compute(&pitch_pid2);
            // printf("  %6.4f == %6.4f ",error_pitch, pitch_pid2.myOutput);
            // double error_pitch2 = map_value(pitch_pid2.myOutput , -45.0, 45.0, -100.0, 100.0);

            error_pitch = pid_get_error(&pitch_pid, gyro_degrees_dead_zone_adjusted[0], esp_timer_get_time());
            // error_pitch = map_value(error_pitch, -45.0, 45.0, -100.0, 100.0);

            // error_yaw = map_value(pid_get_error(&yaw_pid, gyro_degrees[2], esp_timer_get_time()), -180.0, 180.0, -100.0, 100.0);
            // error_pitch = apply_dead_zone(error_pitch, 100.0, -100.0, target_dead_zone_percent);
            // error_speed_x = pid_get_error(&wheel_speed_x_pid, wheels_speed[1], esp_timer_get_time());

            // Try adding error of acceleration here
            float motor_a_control = (-error_pitch) + error_yaw - error_speed_x; // Decrease speed at the cost of pitch 
            float motor_b_control = (-error_pitch) - error_yaw - error_speed_x;

            //printf("(5) ");
            //track_time();

            change_speed_motor_A(motor_a_control, 0); // 31.5 - 2
            change_speed_motor_B(motor_b_control, 0); // 26.9 - 2

            optical_encoder_set_clockwise(optical_encoder_1_result , motor_a_control > 0);
            optical_encoder_set_clockwise(optical_encoder_2_result , motor_b_control > 0);

            // printf("(6) ");
            // track_time();

        }else{
            change_speed_motor_A(0, 0);
            change_speed_motor_B(0, 0);
        }

        // printf("(7) ");
        // track_time();

        // Monitoring ###########################################################################################################################################################

