Rokasbarasa1/ESP32-self-balancing-robot/src/main.c
        // printf("SPEED, %9.5f, %9.5f, %9.5f, ", speed[0], error_speed_x, 100.0);
        // printf(" Loop Scanner 1 - %d   %9.5f  ", 
        //     optical_encoder_get_count(optical_encoder_2_result),
        //     optical_encoder_get_hertz(optical_encoder_2_result, 2.55, -2.55)
        // );
        // printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("ERROR, %6.2f, %6.2f, ", error_pitch, error_speed_x);

        // printf("TARGET, %6.2f, ", pitch_target);
        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("NORTH, %6.2f, %6.2f, %6.2f, ", north_direction[0], north_direction[1], north_direction[2]);
        // printf("SPEED 1, %6.2f, %6.2f, %6.2f, ", wheels_speed[0], wheels_speed[1], 0.0);
        // printf("\n"); 
        

        handle_loop_timing();
    }
}

void fix_mag_axis(float* magnetometer_data){
    float temp = 0.0;
    temp = magnetometer_data[0];
    // y is x
    magnetometer_data[0] = magnetometer_data[1];
    // x is -y
    magnetometer_data[1] = -temp;
}

void check_calibrations(){
    // Checking errors of mpu6050
    find_accelerometer_error(1000);
    find_gyro_error(300);


    // TB6612 and power bank - A 31.5 - 2   B 26.9 - 2
    // L298 and 2 x 18650 cells - A 69.8   B 70  // z Worked very good with above settings though, very smooth
    // L298 and 3 x 18650 cells - A 52.5   B 52.5  
    // TB6612 and 3 x 18650 cells - A 15.5  B 12.5  


    uint8_t movements_in_a_row = 5;
    uint8_t move_counter = 0;

    // Check the fuckedupedness of motors and at what percentage they start to spin.
    float speed = 0;
    while (speed != 100)
    {
        printf("Speed %9.5f\n", speed);
        change_speed_motor_A(speed, 0); // 34.9 the one with the broken pegs 31.5
        speed += 0.5;
        vTaskDelay(250 / portTICK_RATE_MS);
        change_speed_motor_A(0, 0); // sometimes the motor doesn't have enough leverage between steps of voltage
        vTaskDelay(250 / portTICK_RATE_MS);

        if(optical_encoder_get_count(optical_encoder_2_result) != 0 ){
            printf("Spin \n");
            optical_encoder_set_count(optical_encoder_2_result, 0);
            move_counter++;

            if(move_counter == movements_in_a_row){
                printf("Motor A start speed - %f \n", speed - 0.5);
                break;
            }
        }else{
            move_counter = 0;
        }
    }
    change_speed_motor_A(0, 0);
    speed = 0;
    while (speed != 100)
    {
        printf("Speed %9.5f\n", speed);
        change_speed_motor_B(speed, 0); // 26.9
        speed += 0.5;
        vTaskDelay(250 / portTICK_RATE_MS);
        change_speed_motor_B(0, 0); // sometimes the motor doesn't have enough leverage between steps of voltage
        vTaskDelay(250 / portTICK_RATE_MS);

        if(optical_encoder_get_count(optical_encoder_1_result) != 0 ){
            printf("Spin \n");
            optical_encoder_set_count(optical_encoder_1_result, 0);
            move_counter++;

            if(move_counter == movements_in_a_row){
                printf("Motor B start speed - %f \n", speed - 0.5);
                break;
            }
        }else{
            move_counter = 0;
        }
    }
    change_speed_motor_B(0, 0);
}

void init_sensors(){
    // Init sensors
    printf("-----------------------------INITIALIZING MODULES...\n");

    bool mpu6050 = init_mpu6050(GPIO_NUM_22, GPIO_NUM_21, true, true, accelerometer_correction, gyro_correction, complementary_ratio);
    bool gy271 = init_gy271(GPIO_NUM_22, GPIO_NUM_21, false, true, hard_iron_correction, soft_iron_correction);
    init_TB6612(GPIO_NUM_33, GPIO_NUM_32, GPIO_NUM_25, GPIO_NUM_27, GPIO_NUM_26, GPIO_NUM_14);
    bool nrf24 = nrf24_init(SPI3_HOST, GPIO_NUM_17, GPIO_NUM_16);
    optical_encoder_1_result = init_optical_encoder(GPIO_NUM_4, true, 0.2356, 20, 0.2);
    optical_encoder_2_result = init_optical_encoder(GPIO_NUM_15, false, 0.2356, 20, 0.2);

    printf("-----------------------------INITIALIZING MODULES DONE... ");
    if (mpu6050 && gy271 && nrf24 && optical_encoder_1_result >= 0 && optical_encoder_2_result >= 0){
        printf("OK\n");
    }else{
        printf("NOT OK %d %d %d %d %d\n", mpu6050, gy271, nrf24, optical_encoder_1_result, optical_encoder_2_result);
    }

    nrf24_rx_mode(tx_address, 10);
}

void init_esp32_peripherals(){
    init_spi3();
}

void init_loop_timer(){
    // Init loop timer
    loop_start_time = esp_timer_get_time()/1000;
    vTaskDelay(1000 / portTICK_RATE_MS);
}

void get_initial_position(){
    // Find the initial position in degrees and apply it to the gyro measurement integral
    // This will tell the robot which way to go to get the actual upward
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    gy271_magnetometer_readings_micro_teslas(magnetometer_data);
    fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050

    calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation);
    calculate_yaw(magnetometer_data, &accelerometer_z_rotation);

    gyro_degrees[0] = accelerometer_x_rotation;
    gyro_degrees[1] = accelerometer_y_rotation;
    gyro_degrees[2] = accelerometer_z_rotation;

    printf("Initial location x: %.2f y: %.2f, z: %.2f\n", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
}


void extract_joystick_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll)
{
    // Skip the request type
    char* start = strchr(request, '/') + 1;
    char* end = strchr(start, '/');

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    int length = end - start;
    char throttle_string[length + 1];
    strncpy(throttle_string, start, length);
    throttle_string[length] = '\0';
    *throttle = atoi(throttle_string);
    //printf("'%s'\n", throttle_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char yaw_string[length + 1];
    strncpy(yaw_string, start, length);
    yaw_string[length] = '\0';
    *yaw = atoi(yaw_string);
    //printf("'%s'\n", yaw_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char pitch_string[length + 1];
    strncpy(pitch_string, start, length);
    pitch_string[length] = '\0';
    *pitch = atoi(pitch_string);
    //printf("'%s'\n", pitch_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char roll_string[length + 1];
    strncpy(roll_string, start, length);
    roll_string[length] = '\0';
    *roll = atoi(roll_string);
    //printf("'%s'\n", roll_string);
}

